#+title: Completion at point
#+date:
#+hugo_base_dir: ~/Documents/Projects/mac-into-sh/
#+export_file_name: index
#+hugo_bundle: completion-at-point
* Completion at point
#+begin_src emacs-lisp
  (setq tab-always-indent 'complete)
#+end_src

https://with-emacs.com/posts/tutorials/customize-completion-at-point/

#+begin_src emacs-lisp
  (autoload 'ffap-file-at-point "ffap")
  (defun complete-path-at-point+ ()
    "Return completion data for UNIX path at point."
    (let ((fn (ffap-file-at-point))
          (fap (thing-at-point 'filename)))
      (when (and (or fn (equal "/" fap))
                 (save-excursion
                   (search-backward fap (line-beginning-position) t)))
        (list (match-beginning 0)
              (match-end 0)
              #'completion-file-name-table :exclusive 'no))))

  (add-hook 'completion-at-point-functions
            #'complete-path-at-point+
            'append)
#+end_src

#+results:
| tags-completion-at-point-function | complete-path-at-point+ |


* Metadata                       :noexport:blog:unpublished:
